Infineon/AURIX_code_examples/code_examples/OneEye_UART_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxMinimcds_reg.h
/** \brief 818, Event Definition Register 6 */
#define MINIMCDS_MCX_EVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718818u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT6.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT6.
*/
#define MINIMCDS_MCXEVT6 (MINIMCDS_MCX_EVT6)

/** \brief 81C, Event Definition Register 7 */
#define MINIMCDS_MCX_EVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB71881Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT7.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT7.
*/
#define MINIMCDS_MCXEVT7 (MINIMCDS_MCX_EVT7)

/** \brief 820, Event Definition Register 8 */
#define MINIMCDS_MCX_EVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718820u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT8.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT8.
*/
#define MINIMCDS_MCXEVT8 (MINIMCDS_MCX_EVT8)

/** \brief 824, Event Definition Register 9 */
#define MINIMCDS_MCX_EVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718824u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT9.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT9.
*/
#define MINIMCDS_MCXEVT9 (MINIMCDS_MCX_EVT9)

/** \brief 828, Event Definition Register 10 */
#define MINIMCDS_MCX_EVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718828u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT10.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT10.
*/
#define MINIMCDS_MCXEVT10 (MINIMCDS_MCX_EVT10)

/** \brief 82C, Event Definition Register 11 */
#define MINIMCDS_MCX_EVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB71882Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT11.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT11.
*/
#define MINIMCDS_MCXEVT11 (MINIMCDS_MCX_EVT11)

/** \brief 830, Event Definition Register 12 */
#define MINIMCDS_MCX_EVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718830u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT12.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT12.
*/
#define MINIMCDS_MCXEVT12 (MINIMCDS_MCX_EVT12)

/** \brief 834, Event Definition Register 13 */
#define MINIMCDS_MCX_EVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718834u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT13.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT13.
*/
#define MINIMCDS_MCXEVT13 (MINIMCDS_MCX_EVT13)

/** \brief 838, Event Definition Register 14 */
#define MINIMCDS_MCX_EVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB718838u)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT14.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT14.
*/
#define MINIMCDS_MCXEVT14 (MINIMCDS_MCX_EVT14)

/** \brief 83C, Event Definition Register 15 */
#define MINIMCDS_MCX_EVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_EVT*)0xFB71883Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT15.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT15.
*/
#define MINIMCDS_MCXEVT15 (MINIMCDS_MCX_EVT15)

/** \brief 880, Action Definition Register 0 */
#define MINIMCDS_MCX_ACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718880u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT0.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT0.
*/
#define MINIMCDS_MCXACT0 (MINIMCDS_MCX_ACT0)

/** \brief 884, Action Definition Register 1 */
#define MINIMCDS_MCX_ACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718884u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT1.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT1.
*/
#define MINIMCDS_MCXACT1 (MINIMCDS_MCX_ACT1)

/** \brief 888, Action Definition Register 2 */
#define MINIMCDS_MCX_ACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718888u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT2.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT2.
*/
#define MINIMCDS_MCXACT2 (MINIMCDS_MCX_ACT2)

/** \brief 88C, Action Definition Register 3 */
#define MINIMCDS_MCX_ACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB71888Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT3.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT3.
*/
#define MINIMCDS_MCXACT3 (MINIMCDS_MCX_ACT3)

/** \brief 890, Action Definition Register 4 */
#define MINIMCDS_MCX_ACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718890u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT4.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT4.
*/
#define MINIMCDS_MCXACT4 (MINIMCDS_MCX_ACT4)

/** \brief 894, Action Definition Register 5 */
#define MINIMCDS_MCX_ACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718894u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT5.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT5.
*/
#define MINIMCDS_MCXACT5 (MINIMCDS_MCX_ACT5)

/** \brief 898, Action Definition Register 6 */
#define MINIMCDS_MCX_ACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718898u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT6.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT6.
*/
#define MINIMCDS_MCXACT6 (MINIMCDS_MCX_ACT6)

/** \brief 89C, Action Definition Register 7 */
#define MINIMCDS_MCX_ACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB71889Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT7.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT7.
*/
#define MINIMCDS_MCXACT7 (MINIMCDS_MCX_ACT7)

/** \brief 8A0, Action Definition Register 8 */
#define MINIMCDS_MCX_ACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188A0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT8.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT8.
*/
#define MINIMCDS_MCXACT8 (MINIMCDS_MCX_ACT8)

