Infineon/AURIX_code_examples/code_examples/OneEye_UART_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxMinimcds_reg.h
/** \brief 8F0, Action Definition Register 28 */
#define MINIMCDS_MCX_ACT28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188F0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT28.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT28.
*/
#define MINIMCDS_MCXACT28 (MINIMCDS_MCX_ACT28)

/** \brief 8F4, Action Definition Register 29 */
#define MINIMCDS_MCX_ACT29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188F4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT29.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT29.
*/
#define MINIMCDS_MCXACT29 (MINIMCDS_MCX_ACT29)

/** \brief 8F8, Action Definition Register 30 */
#define MINIMCDS_MCX_ACT30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188F8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT30.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT30.
*/
#define MINIMCDS_MCXACT30 (MINIMCDS_MCX_ACT30)

/** \brief 8FC, Action Definition Register 31 */
#define MINIMCDS_MCX_ACT31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188FCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT31.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT31.
*/
#define MINIMCDS_MCXACT31 (MINIMCDS_MCX_ACT31)

/** \brief 900, Action Definition Register 32 */
#define MINIMCDS_MCX_ACT32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718900u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT32.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT32.
*/
#define MINIMCDS_MCXACT32 (MINIMCDS_MCX_ACT32)

/** \brief 904, Action Definition Register 33 */
#define MINIMCDS_MCX_ACT33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718904u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT33.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT33.
*/
#define MINIMCDS_MCXACT33 (MINIMCDS_MCX_ACT33)

/** \brief 908, Action Definition Register 34 */
#define MINIMCDS_MCX_ACT34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718908u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT34.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT34.
*/
#define MINIMCDS_MCXACT34 (MINIMCDS_MCX_ACT34)

/** \brief 90C, Action Definition Register 35 */
#define MINIMCDS_MCX_ACT35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB71890Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT35.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT35.
*/
#define MINIMCDS_MCXACT35 (MINIMCDS_MCX_ACT35)

/** \brief 910, Action Definition Register 36 */
#define MINIMCDS_MCX_ACT36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718910u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT36.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT36.
*/
#define MINIMCDS_MCXACT36 (MINIMCDS_MCX_ACT36)

/** \brief 914, Action Definition Register 37 */
#define MINIMCDS_MCX_ACT37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718914u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT37.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT37.
*/
#define MINIMCDS_MCXACT37 (MINIMCDS_MCX_ACT37)

/** \brief 918, Action Definition Register 38 */
#define MINIMCDS_MCX_ACT38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718918u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT38.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT38.
*/
#define MINIMCDS_MCXACT38 (MINIMCDS_MCX_ACT38)

/** \brief 91C, Action Definition Register 39 */
#define MINIMCDS_MCX_ACT39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB71891Cu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT39.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT39.
*/
#define MINIMCDS_MCXACT39 (MINIMCDS_MCX_ACT39)

/** \brief 920, Action Definition Register 40 */
#define MINIMCDS_MCX_ACT40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718920u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT40.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT40.
*/
#define MINIMCDS_MCXACT40 (MINIMCDS_MCX_ACT40)

/** \brief 924, Action Definition Register 41 */
#define MINIMCDS_MCX_ACT41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718924u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT41.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT41.
*/
#define MINIMCDS_MCXACT41 (MINIMCDS_MCX_ACT41)

/** \brief A00, Counter Control Register */
#define MINIMCDS_MCX_CNT0_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A00u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT0_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT0_CCL.
*/
#define MINIMCDS_MCXCCL0 (MINIMCDS_MCX_CNT0_CCL)

/** \brief A04, Counter Limit Register */
#define MINIMCDS_MCX_CNT0_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A04u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT0_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT0_LMT.
*/
#define MINIMCDS_MCXLMT0 (MINIMCDS_MCX_CNT0_LMT)

/** \brief A08, Current Count Register */
#define MINIMCDS_MCX_CNT0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A08u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT0_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT0_CNT.
*/
#define MINIMCDS_MCXCNT0 (MINIMCDS_MCX_CNT0_CNT)

/** \brief A10, Counter Control Register */
#define MINIMCDS_MCX_CNT1_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A10u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT1_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT1_CCL.
*/
#define MINIMCDS_MCXCCL1 (MINIMCDS_MCX_CNT1_CCL)

/** \brief A14, Counter Limit Register */
#define MINIMCDS_MCX_CNT1_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A14u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT1_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT1_LMT.
*/
#define MINIMCDS_MCXLMT1 (MINIMCDS_MCX_CNT1_LMT)

/** \brief A18, Current Count Register */
#define MINIMCDS_MCX_CNT1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A18u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT1_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT1_CNT.
*/
#define MINIMCDS_MCXCNT1 (MINIMCDS_MCX_CNT1_CNT)

/** \brief A20, Counter Control Register */
#define MINIMCDS_MCX_CNT2_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CCL*)0xFB718A20u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT2_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT2_CCL.
*/
#define MINIMCDS_MCXCCL2 (MINIMCDS_MCX_CNT2_CCL)

/** \brief A24, Counter Limit Register */
#define MINIMCDS_MCX_CNT2_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_LMT*)0xFB718A24u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT2_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT2_LMT.
*/
#define MINIMCDS_MCXLMT2 (MINIMCDS_MCX_CNT2_LMT)

/** \brief A28, Current Count Register */
#define MINIMCDS_MCX_CNT2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MINIMCDS_MCX_CNT_CNT*)0xFB718A28u)
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT2_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT2_CNT.
*/
#define MINIMCDS_MCXCNT2 (MINIMCDS_MCX_CNT2_CNT)

